Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inputs (InputLayer)          (None, 150)               0         
_________________________________________________________________
embedding_1 (Embedding)      (None, 150, 50)           50000     
_________________________________________________________________
lstm_1 (LSTM)                (None, 64)                29440     
_________________________________________________________________
FC1 (Dense)                  (None, 256)               16640     
_________________________________________________________________
activation_1 (Activation)    (None, 256)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
out_layer (Dense)            (None, 1)                 257       
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 96,337
Trainable params: 96,337
Non-trainable params: 0


Train on 3565 samples, validate on 892 samples
Epoch 1/10
3565/3565 [==============================] - 3s 746us/step - loss: 0.3545 - accuracy: 0.8561 - val_loss: 0.1831 - val_accuracy: 0.9596
Epoch 2/10
3565/3565 [==============================] - 3s 781us/step - loss: 0.1033 - accuracy: 0.9759 - val_loss: 0.0875 - val_accuracy: 0.9765
Epoch 3/10
3565/3565 [==============================] - 2s 652us/step - loss: 0.0519 - accuracy: 0.9865 - val_loss: 0.0748 - val_accuracy: 0.9765
Epoch 4/10
3565/3565 [==============================] - 3s 710us/step - loss: 0.0360 - accuracy: 0.9885 - val_loss: 0.0512 - val_accuracy: 0.9877
Epoch 5/10
3565/3565 [==============================] - 3s 717us/step - loss: 0.0293 - accuracy: 0.9910 - val_loss: 0.0549 - val_accuracy: 0.9843
Training Completed
1115/1115 [==============================] - 0s 365us/step
Test set
  Loss: 0.052
  Accuracy: 0.983
